#include <iostream>
#include <vector>
#include <windows.h>
int main() {
  SetConsoleOutputCP(CP_UTF8);
  std::cout << "Функция Z:\n"
               "Z = 0x[1] 6x[2] 0x[3] 8x[4] 0x[5] 3x[6]\n"
               "Изначальная систему СЛАУ:\n"
               "1,      -4,     0,      -5,     0,      -3,     9,\n"
               "0,      7,      1,      5,      0,      4,      26,\n"
               "0,      3,      0,      -5,     1,      -4,     10,\n"
               "\n"
               "Проверка на кол-во базисов: 1\n"
               "Изначальная таблица Симплекс метода:\n"
               "1,      -4,     0,      -5,     0,      -3,     9,\n"
               "0,      7,      1,      5,      0,      4,      26,\n"
               "0,      3,      0,      -5,     1,      -4,     10,\n"
               "0,      -6,     0,      -8,     0,      -3,     0,\n"
               "\n"
               "Индекс разрешающего столбца: 3\n"
               "Индекс разрешающей строки: 0\n"
               "-------------------------------------------------------\n"
               "1 таблица Симплекс метода\n"
               "-0.2,\t0.8,\t0\t1\t0\t0.6\t-1.8,\n"
               "1,\t3,\t1,\t0,\t0,\t1,\t35,\n"
               "-1,\t7,\t0,\t0,\t1,\t-1,\t1,\n"
               "-1.6,\t0.4,\t0,\t0,\t0,\t1.8,\t-16.4,\n"
               "\n"
               "Индекс разрешающего столбца: 0\n"
               "Индекс разрешающей строки: 0\n"
               "-------------------------------------------------------\n"
               "2 таблица Симплекс метода\n"
               "1,\t4,\t0,\t5,\t0,\t3,\t9,\n"
               "0,\t-1,\t1,\t-5,\t0,\t-2,\t26,\n"
               "0,\t11,\t0,\t5,\t1,\t2,\t10,\n"
               "0,\t1.36,\t0,\t8,\t0,\t1.32,\t0,\n"
               "\n"
               "x[1]= 9\n"
               "x[3]= 26\n"
               "x[5]= 10\n"
               "Zmax= 0" << std::endl;
  return 0;
}
